**Source**: 
[10 minutes to pandas](https://pandas.pydata.org/docs/user_guide/10min.html)

In [1]:
import numpy as np

import pandas as pd

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
dates = pd.date_range("20130101", periods=6)

dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01  1.959288  0.179709  1.020837  1.549745
2013-01-02 -2.791541 -0.018032  2.202973  0.860410
2013-01-03  1.497767 -0.240813  0.168063 -1.813803
2013-01-04 -1.427326  0.004326 -0.860235  1.360415
2013-01-05  1.332210  1.094376  1.935936  0.100124
2013-01-06  0.387483  1.947005 -0.682155 -0.789300

In [5]:
df.to_numpy()

array([[ 1.95928806,  0.1797095 ,  1.02083721,  1.54974476],
       [-2.79154069, -0.01803215,  2.20297334,  0.86040967],
       [ 1.49776719, -0.24081299,  0.16806271, -1.81380312],
       [-1.42732647,  0.00432597, -0.86023544,  1.36041543],
       [ 1.33221022,  1.09437559,  1.9359361 ,  0.10012397],
       [ 0.38748305,  1.94700498, -0.68215549, -0.78930034]])

In [6]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.159647  0.494428  0.630903  0.211265
std    1.880642  0.849983  1.302951  1.315131
min   -2.791541 -0.240813 -0.860235 -1.813803
25%   -0.973624 -0.012443 -0.469601 -0.566944
50%    0.859847  0.092018  0.594450  0.480267
75%    1.456378  0.865709  1.707161  1.235414
max    1.959288  1.947005  2.202973  1.549745

In [7]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    1.959288   -2.791541    1.497767   -1.427326    1.332210    0.387483
B    0.179709   -0.018032   -0.240813    0.004326    1.094376    1.947005
C    1.020837    2.202973    0.168063   -0.860235    1.935936   -0.682155
D    1.549745    0.860410   -1.813803    1.360415    0.100124   -0.789300

In [8]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  1.549745  1.020837  0.179709  1.959288
2013-01-02  0.860410  2.202973 -0.018032 -2.791541
2013-01-03 -1.813803  0.168063 -0.240813  1.497767
2013-01-04  1.360415 -0.860235  0.004326 -1.427326
2013-01-05  0.100124  1.935936  1.094376  1.332210
2013-01-06 -0.789300 -0.682155  1.947005  0.387483

In [9]:
df.sort_values(by="B", ascending=False)

                   A         B         C         D
2013-01-06  0.387483  1.947005 -0.682155 -0.789300
2013-01-05  1.332210  1.094376  1.935936  0.100124
2013-01-01  1.959288  0.179709  1.020837  1.549745
2013-01-04 -1.427326  0.004326 -0.860235  1.360415
2013-01-02 -2.791541 -0.018032  2.202973  0.860410
2013-01-03  1.497767 -0.240813  0.168063 -1.813803

In [10]:
df.sort_values(by="B", ascending=True) # True is the default value

                   A         B         C         D
2013-01-03  1.497767 -0.240813  0.168063 -1.813803
2013-01-02 -2.791541 -0.018032  2.202973  0.860410
2013-01-04 -1.427326  0.004326 -0.860235  1.360415
2013-01-01  1.959288  0.179709  1.020837  1.549745
2013-01-05  1.332210  1.094376  1.935936  0.100124
2013-01-06  0.387483  1.947005 -0.682155 -0.789300

In [11]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)


df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [12]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

## Viewing data

In [13]:
df.head(2)

                   A         B         C         D
2013-01-01  1.959288  0.179709  1.020837  1.549745
2013-01-02 -2.791541 -0.018032  2.202973  0.860410

In [14]:
df.tail(2)

                   A         B         C         D
2013-01-05  1.332210  1.094376  1.935936  0.100124
2013-01-06  0.387483  1.947005 -0.682155 -0.789300

## Selection

### Selection by label

In [15]:
# get item "[]"
df["A"]

2013-01-01    1.959288
2013-01-02   -2.791541
2013-01-03    1.497767
2013-01-04   -1.427326
2013-01-05    1.332210
2013-01-06    0.387483
Freq: D, Name: A, dtype: float64

In [16]:
# rows slicing
df[0:2]

                   A         B         C         D
2013-01-01  1.959288  0.179709  1.020837  1.549745
2013-01-02 -2.791541 -0.018032  2.202973  0.860410

In [17]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02 -2.791541 -0.018032  2.202973  0.860410
2013-01-03  1.497767 -0.240813  0.168063 -1.813803
2013-01-04 -1.427326  0.004326 -0.860235  1.360415

In [18]:
# Selection by label
df.loc[dates[0]]

A    1.959288
B    0.179709
C    1.020837
D    1.549745
Name: 2013-01-01 00:00:00, dtype: float64

In [19]:
# Selection by row label
df.loc["20130102"]

A   -2.791541
B   -0.018032
C    2.202973
D    0.860410
Name: 2013-01-02 00:00:00, dtype: float64

In [20]:
# Selection by colomn label
# # Selecting all rows (:) with a select column labels:
df.loc[:, "A"]

2013-01-01    1.959288
2013-01-02   -2.791541
2013-01-03    1.497767
2013-01-04   -1.427326
2013-01-05    1.332210
2013-01-06    0.387483
Freq: D, Name: A, dtype: float64

In [21]:
# Selecting all rows (:) with a select column labels:
df.loc[:, ["A", "B"]]

                   A         B
2013-01-01  1.959288  0.179709
2013-01-02 -2.791541 -0.018032
2013-01-03  1.497767 -0.240813
2013-01-04 -1.427326  0.004326
2013-01-05  1.332210  1.094376
2013-01-06  0.387483  1.947005

In [22]:
# In label slicing, both endpoints are included:
df.loc["20130102":"20130104", ["A", "B"]]

                   A         B
2013-01-02 -2.791541 -0.018032
2013-01-03  1.497767 -0.240813
2013-01-04 -1.427326  0.004326

In [23]:
df.loc["20130102":"20130104", "A":"C"]

                   A         B         C
2013-01-02 -2.791541 -0.018032  2.202973
2013-01-03  1.497767 -0.240813  0.168063
2013-01-04 -1.427326  0.004326 -0.860235

In [24]:
# Selecting a single row and column label returns a scalar:
df.loc[dates[0], "A"]

1.9592880567575688

In [25]:
# For getting fast access to a scalar (equivalent to the prior method):
df.at[dates[0], "A"]

1.9592880567575688

### Selection by position

In [26]:
# pass integer index sililar to python/numpy
df.iloc[3]

A   -1.427326
B    0.004326
C   -0.860235
D    1.360415
Name: 2013-01-04 00:00:00, dtype: float64

In [27]:
#slices 
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -1.427326  0.004326
2013-01-05  1.332210  1.094376

In [28]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -2.791541 -0.018032  2.202973  0.860410
2013-01-03  1.497767 -0.240813  0.168063 -1.813803

In [29]:
# Lists of integer position locations:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02 -2.791541  2.202973
2013-01-03  1.497767  0.168063
2013-01-05  1.332210  1.935936

In [30]:
# getting a scaler value explicitly:
df.iloc[1, 1]

-0.018032149558173987

In [31]:
df.iat[1, 1]

-0.018032149558173987

In [34]:
df.A

2013-01-01    1.959288
2013-01-02   -2.791541
2013-01-03    1.497767
2013-01-04   -1.427326
2013-01-05    1.332210
2013-01-06    0.387483
Freq: D, Name: A, dtype: float64

### Boolean indexing

In [36]:
# Select rows where df.A is greater than 0.

df[df["A"] > 0]

                   A         B         C         D
2013-01-01  1.959288  0.179709  1.020837  1.549745
2013-01-03  1.497767 -0.240813  0.168063 -1.813803
2013-01-05  1.332210  1.094376  1.935936  0.100124
2013-01-06  0.387483  1.947005 -0.682155 -0.789300

In [37]:
# Selecting values from a DataFrame where a boolean condition is met:
df[df > 0]

                   A         B         C         D
2013-01-01  1.959288  0.179709  1.020837  1.549745
2013-01-02       NaN       NaN  2.202973  0.860410
2013-01-03  1.497767       NaN  0.168063       NaN
2013-01-04       NaN  0.004326       NaN  1.360415
2013-01-05  1.332210  1.094376  1.935936  0.100124
2013-01-06  0.387483  1.947005       NaN       NaN

### Ffiltering

In [42]:
# Using isin() method for filtering:

df2 = df.copy()

df2["E"] = ["one", "one", "two", "three", "four", "three"]

df2

                   A         B         C         D      E
2013-01-01  1.959288  0.179709  1.020837  1.549745    one
2013-01-02 -2.791541 -0.018032  2.202973  0.860410    one
2013-01-03  1.497767 -0.240813  0.168063 -1.813803    two
2013-01-04 -1.427326  0.004326 -0.860235  1.360415  three
2013-01-05  1.332210  1.094376  1.935936  0.100124   four
2013-01-06  0.387483  1.947005 -0.682155 -0.789300  three

In [44]:
# is ["two", "four"] in df2["E"] -- > true/false

df2["E"].isin(["two", "four"])

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04    False
2013-01-05     True
2013-01-06    False
Freq: D, Name: E, dtype: bool

In [45]:
df2[df2["E"].isin(["two", "four"])]

                   A         B         C         D     E
2013-01-03  1.497767 -0.240813  0.168063 -1.813803   two
2013-01-05  1.332210  1.094376  1.935936  0.100124  four

### Setting

In [50]:
# Setting a new column automatically aligns the data by the indexes:

s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range("20130103", periods=6))
s1

2013-01-03    1
2013-01-04    2
2013-01-05    3
2013-01-06    4
2013-01-07    5
2013-01-08    6
Freq: D, dtype: int64

In [51]:
df["F"] = s1
df

                   A         B         C         D    F
2013-01-01  1.959288  0.179709  1.020837  1.549745  NaN
2013-01-02 -2.791541 -0.018032  2.202973  0.860410  NaN
2013-01-03  1.497767 -0.240813  0.168063 -1.813803  1.0
2013-01-04 -1.427326  0.004326 -0.860235  1.360415  2.0
2013-01-05  1.332210  1.094376  1.935936  0.100124  3.0
2013-01-06  0.387483  1.947005 -0.682155 -0.789300  4.0

In [54]:
# Setting values by label:
df.at[dates[0], "A"] = 888
df

                     A         B         C         D    F
2013-01-01  888.000000  0.179709  1.020837  1.549745  NaN
2013-01-02   -2.791541 -0.018032  2.202973  0.860410  NaN
2013-01-03    1.497767 -0.240813  0.168063 -1.813803  1.0
2013-01-04   -1.427326  0.004326 -0.860235  1.360415  2.0
2013-01-05    1.332210  1.094376  1.935936  0.100124  3.0
2013-01-06    0.387483  1.947005 -0.682155 -0.789300  4.0

In [56]:
# Setting values by position:
df.iat[0, 1] = 999
df

                     A           B         C         D    F
2013-01-01  888.000000  999.000000  1.020837  1.549745  NaN
2013-01-02   -2.791541   -0.018032  2.202973  0.860410  NaN
2013-01-03    1.497767   -0.240813  0.168063 -1.813803  1.0
2013-01-04   -1.427326    0.004326 -0.860235  1.360415  2.0
2013-01-05    1.332210    1.094376  1.935936  0.100124  3.0
2013-01-06    0.387483    1.947005 -0.682155 -0.789300  4.0

In [58]:
# Setting by assigning with a NumPy array:
df.loc[:, "D"] = np.array([5] * len(df))
df

                     A           B         C  D    F
2013-01-01  888.000000  999.000000  1.020837  5  NaN
2013-01-02   -2.791541   -0.018032  2.202973  5  NaN
2013-01-03    1.497767   -0.240813  0.168063  5  1.0
2013-01-04   -1.427326    0.004326 -0.860235  5  2.0
2013-01-05    1.332210    1.094376  1.935936  5  3.0
2013-01-06    0.387483    1.947005 -0.682155  5  4.0